Центр_управления_производительностью_демо/src/Catalogs/Ресурсы/Ресурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ресурсы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ИнформационныеБазы</owners>
  <attributes>
    <name>Хеш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Измерения</name>
    <attributes>
      <name>Измерение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/Enums/ТипыРесурсов/ТипыРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРесурсов</name>
  <enumValues>
    <name>ОбъектМетаданных</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>Индекс</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Catalogs/Ресурсы/ManagerModule.bsl
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") Тогда
		СтандартнаяОбработка = Ложь;
		Если Параметры.Ключ.Тип = Перечисления.ТипыРесурсов.ОбъектМетаданных Тогда
			ВыбраннаяФорма = "ФормаОбъектаМетаданных";
			
		ИначеЕсли Параметры.Ключ.Тип = Перечисления.ТипыРесурсов.Таблица Тогда
			ВыбраннаяФорма = "ФормаТаблицы";
			
		ИначеЕсли Параметры.Ключ.Тип = Перечисления.ТипыРесурсов.Индекс Тогда
			ВыбраннаяФорма = "ФормаИндекса";
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
